# DTM6_IsDTM6Object

## Description
Check if the passed object handle is for SiteModel object type.

```pascal
FUNCTION DTM6_IsDTM6Object(hDTMObject : HANDLE) : BOOLEAN;
```

```python

def vs.DTM6_IsDTM6Object(hDTMObject):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hDTMObject|HANDLE||

## Version
Availability: from Vectorworks 2011
## Category
* SiteModel Interface Library